settlingTank2D_base/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type basicMultiphaseSystem;

phases (particles water);

particles
{
    type          pureIsothermalPhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               3e-4;
    }

    alphaMax        0.07; // Based on literature info
    residualAlpha   1e-6;
}

water
{
    type          pureIsothermalPhaseModel;
    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }

    residualAlpha   0;
}

blending
{
    default
    {
        type            none;
        continuousPhase water;
        /*
        // Alternative Setting. Unknown effects other than allow discrete phase higher volume fraction?
        minFullyContinuousAlpha.water = 0.7
        minPartlyContinuousAlpha.water = 0.3
        minFullyContinuousAlpha.particles = 0.7
        minPartlyContinuousAlpha.particles = 0.3
        */
    }
}

surfaceTension
(
    (particles and water)
    {
        type            constant;
        sigma           0;
    }
);

aspectRatio
();

drag
(
    (particles in water)
    {
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (particles in water)
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
);

heatTransfer
();

phaseTransfer
();

lift
();

wallLubrication
();

turbulentDispersion
();

interfaceCompression
();

// Minimum allowable pressure
pMin            10000;

// ************************************************************************* //
