settlingTank2D_base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 3;
        implicitPhasePressure yes;

        extremaCoeff    1;

        solver          PBiCGStab;
        preconditioner  DIC;

        tolerance       1e-9;
        relTol          0;
        minIter         1;
    }
    
    p_rgh
    {
        solver		 PCG;
        preconditioner	 DIC;
        tolerance       1e-06;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }
}

PIMPLE
{
    // momentumPredictor yes; // Require definition of linear solvers for the variables .*Final (Regex notation)
    nOuterCorrectors    1; // More of this increases computatonal cost significantly
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
    
    pRefCell            0; // Required by PIMPLE it seems
    pRefValue           0;
}

relaxationFactors
{
    equations
    {
        ".*"            1; // No Under-relaxation ensuring that it is time accurate, otherwise it would be running in Pseudi-Transient simulation mode. 
    }
}

// ************************************************************************* //
