settlingTank2D_base/system/setFieldsDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue alpha.particles 0
);


// Based on Literature, Uniform Distribution
regions
(
    boxToCell
    {
        box (-15 -15 0) (15 15 61);
        fieldValues
        (
            volScalarFieldValue alpha.water 0.966
            volScalarFieldValue alpha.particles 0.034 
        );
    }
);

// ************************************************************************* //
