settlingTank2D_base/system/topoSetDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // creates a set of Cells called MRFcyl.
    {
        name    MRFcyl_0;
        type    cellSet;
        action  new;
        
        source  cylinderToCell;
        sourceInfo
        {
           p1 (0 0 4);
           p2 (0 0 42); 
           radius 7.5;
        }
    }
    
    {
        name    MRFcyl_1;
        type    cellSet;
        action  new;
        
        source  cylinderToCell;
        sourceInfo
        {
           p1 (0 0 42);
           p2 (0 0 61); 
           radius 4;
        }
    }
    
    // creates a CellZone (needed for MRFProperties) called rotor.
    {
        name    rotor;
        type    cellZoneSet;
        action  new;
        
        source  setToCellZone;
        sourceInfo
        {
           set MRFcyl_0;
        }
    }

    {
        name    rotor;
        type    cellZoneSet;
        action  add;
        
        source  setToCellZone;
        sourceInfo
        {
           set MRFcyl_1;
        }
    }    
    
);

// ************************************************************************* //
